newwms_gift/src/InformationRegisters/ит_WMS_СвязиЯчеек/ит_WMS_СвязиЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ит_WMS_СвязиЯчеек</name>
  <resources>
    <name>СтоимостьПерехода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/ит_WMS_СвязиЯчеек/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ЯчейкаОтправитель=Запись.ЯчейкаПолучатель Тогда 
		Отказ=Истина;
		Сообщить("Ячейка не может быть отправителем и получаетелм одновременно");
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		Если ДублироватьСвязь Тогда
		МенеджерЗаписи=РегистрыСведений.ит_WMS_СвязиЯчеек.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЯчейкаОтправитель=Запись.ЯчейкаПолучатель;
		МенеджерЗаписи.ЯчейкаПолучатель=Запись.ЯчейкаОтправитель;
		МенеджерЗаписи.СтоимостьПерехода=Запись.СтоимостьПерехода;
		МенеджерЗаписи.Записать();
		КонецЕсли;
КонецПроцедуры
